AccumulationRegisters/ОбъектыВРаботе.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ОбъектыВРаботе</Name>
			<Comment>Трейд Софт</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ОбъектыВРаботеСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОбъектыВРаботеСотрудника</Name>
			<Comment>Трейд Софт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ИнициаторыСобытийДляДопСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ИнициаторыСобытийДляДопСвойств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбъектыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СостоянияПоКатегориям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

AccumulationRegisters/ОбъектыВРаботе/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	//Блокировка = Новый БлокировкаДанных();
	//ЭлементБлокировки_РН = Блокировка.Добавить("РегистрНакопления.ОбъектыВРаботе");
	//ЭлементБлокировки_РН.Режим = РежимБлокировкиДанных.Исключительный;
	//ЭлементБлокировки_РН.УстановитьЗначение("Подразделение", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	//ЭлементБлокировки_РН.УстановитьЗначение("Сотрудник", Справочники.Пользователи.ПустаяСсылка());
	//
	//ЭлементБлокировки_РС = Блокировка.Добавить("РегистрСведений.ОбъектыВРаботеОрганизации");
	//ЭлементБлокировки_РС.Режим = РежимБлокировкиДанных.Исключительный;
	////ЭлементБлокировки_РС.УстановитьЗначение("Объект", Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	////ЭлементБлокировки_РС.УстановитьЗначение("Сотрудник", Справочники.Пользователи.ПустаяСсылка());

	//Блокировка.Заблокировать();
	
	////Организации
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//					  |	ОбъектыВРаботеОстатки.Объект,
	//					  |	ОбъектыВРаботеОстатки.Организация,
	//					  |	ОбъектыВРаботеОрганизации.Объект КАК ОбъектРС,
	//					  |	ОбъектыВРаботеОрганизации.Организация КАК ОрганизацияРС
	//					  |ИЗ
	//					  |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	//					  |			,
	//					  |			Подразделение = ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//					  |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//					  |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыВРаботеОрганизации КАК ОбъектыВРаботеОрганизации
	//					  |		ПО ОбъектыВРаботеОстатки.Объект = ОбъектыВРаботеОрганизации.Объект
	//					  |			И ОбъектыВРаботеОстатки.Организация = ОбъектыВРаботеОрганизации.Организация
	//					  |ГДЕ
	//					  |	(ОбъектыВРаботеОрганизации.Объект ЕСТЬ NULL 
	//					  |			ИЛИ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL )"); 
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если Не ЗначениеЗаполнено(Результат.Объект) Тогда // = Null Тогда //Надо удалить из РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеОрганизации.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.ОбъектРС;
	//		Набор.Организация = Результат.ОрганизацияРС;
	//		Набор.Прочитать();
	//		Попытка
	//			Набор.Удалить();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;	
	//			
	//	Иначе //Надо добавить в РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеОрганизации.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.Объект;
	//		Набор.Организация = Результат.Организация;
	//		Попытка 
	//			Набор.Записать();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	//
	////Подразделение
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ОбъектыВРаботеОстатки.Объект,
	//			   |	ОбъектыВРаботеОстатки.Подразделение,
	//			   |	ОбъектыВРаботеПодразделения.Объект КАК ОбъектРС,               
	//			   |	ОбъектыВРаботеПодразделения.Подразделение КАК ПодразделениеРС
	//			   |ИЗ
	//			   |	РегистрНакопления.ОбъектыВРаботе.Остатки(
	//			   |			,
	//			   |			Подразделение <> ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	//			   |				И Сотрудник = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//			   |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыВРаботеПодразделения КАК ОбъектыВРаботеПодразделения
	//			   |		ПО ОбъектыВРаботеОстатки.Объект = ОбъектыВРаботеПодразделения.Объект
	//			   |			И ОбъектыВРаботеОстатки.Подразделение = ОбъектыВРаботеПодразделения.Подразделение
	//			   |ГДЕ
	//			   |	(ОбъектыВРаботеПодразделения.Объект ЕСТЬ NULL 
	//			   |			ИЛИ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL )"; 
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если Не ЗначениеЗаполнено(Результат.Объект) Тогда // = Null Тогда //Надо удалить из РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеПодразделения.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.ОбъектРС;
	//		Набор.Подразделение = Результат.ПодразделениеРС;
	//		Набор.Прочитать();
	//		Попытка
	//			Набор.Удалить();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;	
	//			
	//	Иначе //Надо добавить в РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеПодразделения.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.Объект;
	//		Набор.Подразделение = Результат.Подразделение;
	//		Попытка 
	//			Набор.Записать();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	//
	////Сотрудник
	//Запрос.Текст = "ВЫБРАТЬ
	//			   |	ОбъектыВРаботеОстатки.Объект,
	//			   |	ОбъектыВРаботеОстатки.Сотрудник,
	//			   |	ОбъектыВРаботеСотрудника.Объект КАК ОбъектРС,
	//			   |	ОбъектыВРаботеСотрудника.Сотрудник КАК СотрудникРС
	//			   |ИЗ
	//			   |	РегистрНакопления.ОбъектыВРаботе.Остатки(, Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)) КАК ОбъектыВРаботеОстатки
	//			   |		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыВРаботеСотрудника КАК ОбъектыВРаботеСотрудника
	//			   |		ПО ОбъектыВРаботеОстатки.Объект = ОбъектыВРаботеСотрудника.Объект
	//			   |			И ОбъектыВРаботеОстатки.Сотрудник = ОбъектыВРаботеСотрудника.Сотрудник
	//			   |ГДЕ
	//			   |	(ОбъектыВРаботеСотрудника.Объект ЕСТЬ NULL 
	//			   |			ИЛИ ОбъектыВРаботеОстатки.Объект ЕСТЬ NULL )"; 
	//Результат = Запрос.Выполнить().Выбрать();
	//Пока Результат.Следующий() Цикл
	//	Если Не ЗначениеЗаполнено(Результат.Объект) Тогда // = Null Тогда //Надо удалить из РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеСотрудника.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.ОбъектРС;
	//		Набор.Сотрудник = Результат.СотрудникРС;
	//		Набор.Прочитать();
	//		Попытка
	//			Набор.Удалить();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;	
	//			
	//	Иначе //Надо добавить в РС
	//		Набор = РегистрыСведений.ОбъектыВРаботеСотрудника.СоздатьМенеджерЗаписи();
	//		Набор.Объект = Результат.Объект;
	//		Набор.Сотрудник = Результат.Сотрудник;
	//		Попытка 
	//			Набор.Записать();
	//		Исключение
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;
	//	КонецЕсли;
	//КонецЦикла;
	
	//КазанцевЯА , в документе Корректировка регистров он там отсутствует реквизит на который идет проверка
	//Документ Корректировка регистров является также регистратором данного регистра, но не должен подстраиваться под логику,а вносить коррективы из ТЧ 
	МетаданныеОбъекта = ЭтотОбъект.Отбор.Регистратор.Значение.Метаданные();
	Если МетаданныеОбъекта.Реквизиты.Найти("Объекты") <> Неопределено Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ОбъектыВРаботеОстатки.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрНакопления.ОбъектыВРаботе.Остатки КАК ОбъектыВРаботеОстатки
		|ГДЕ
		|	ОбъектыВРаботеОстатки.Объект = &Объект
		|	И ОбъектыВРаботеОстатки.Сотрудник <> ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)");
		Для Каждого Стр из ЭтотОбъект.Отбор.Регистратор.Значение.Объекты Цикл
			Запрос.УстановитьПараметр("Объект", Стр.Объект);
			Результат = Запрос.Выполнить().Выбрать();	
			НаборЗаписей = РегистрыСведений.ОбъектыВРаботеСотрудника.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Объект.Установить(Стр.Объект);
			Пока Результат.Следующий() Цикл
				Запись = НаборЗаписей.Добавить();
				Запись.Объект = Стр.Объект;
				Запись.Сотрудник = Результат.Сотрудник;
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	//
	Справочники.ФункцииДополнительныхСвойств.ПроставитьЗначенияДопСвойств(ЭтотОбъект, 
			Перечисления.ИнициаторыСобытийДляДопСвойств.ОбъектыВРаботе);
КонецПроцедуры
